IDEA StatiCa Open Model
OpenModelClassAttribute Constructor (String)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenModelClassAttribute(
	string structuralModelClassType
)
Public Sub New (
	structuralModelClassType As String
)
public:
OpenModelClassAttribute(
	String^ structuralModelClassType
)
Parameters
structuralModelClassType
Type: System.String
Equivalent SM type
See Also
Reference
OpenModelClassAttribute Class
OpenModelClassAttribute Overload
IdeaRS.OpenModel Namespace